# HideSelectedObjects

## Description
Sets the object visibility of all selected objects to &quot;invisible&quot;. Hidden objects can be made visible with Show or UnHideObjects commands.

```pascal
PROCEDURE HideSelectedObjects;
```

```python
def vs.HideSelectedObjects():
    return None
```

## Examples
```python
HideSelectedObjects();
```

## Version
Availability: from Vectorworks 2025

## Category
* Object Attributes